## pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

In [3]:
import pandas as pd

In [9]:
## pd series (one dimensional array like object)

data=[1,2,3,4]

series=pd.Series(data)
print(type(series),"\n",series)

<class 'pandas.core.series.Series'>
 0    1
1    2
2    3
3    4
dtype: int64

In [13]:
## create series from dictionary

data={'a':1, 'b':2, 'c':3, 'd':4}

series=pd.Series(data)
print(type(series),"\n",series)

<class 'pandas.core.series.Series'>
 a    1
b    2
c    3
d    4
dtype: int64

In [15]:
data=[10,20,30,40]
index=['a','b','c','d']

pd.Series(data,index=index)

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
## DataFrame

data={
    'name':['john','bunny','ken'],
    'age':[16,17,21],
    'class':['b','a','c']
}

dataframe = pd.DataFrame(data)
print(dataframe)

    name  age class
0   john   16     b
1  bunny   17     a
2    ken   21     c

In [21]:
## create the dataframe from list of dictionary

data=[
    {'name':'john', 'age':17, 'class':'a'},
    {'name':'bunny', 'age':14, 'class':'c'},
    {'name':'john', 'age':12, 'class':'b'}
]

dataframe = pd.DataFrame(data)
print(dataframe)

    name  age class
0   john   17     a
1  bunny   14     c
2   john   12     b

In [33]:
## raeding data 

df=pd.read_csv("archive/Orders.csv")
df.head() # top 5 rows

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [37]:
df['State']  ##picking up one column

0         Uttar Pradesh
1                 Delhi
2         Uttar Pradesh
3           Maharashtra
4        Madhya Pradesh
             ...
495                 Goa
496              Sikkim
497         Maharashtra
498    Himachal Pradesh
499           Rajasthan
Name: State, Length: 500, dtype: object

In [39]:
df.loc[1]  ##picking up row

Order ID           B-25993
Order Date      03-02-2018
CustomerName        Madhav
State                Delhi
City                 Delhi
Name: 1, dtype: object

In [41]:
df.iloc[1]

Order ID           B-25993
Order Date      03-02-2018
CustomerName        Madhav
State                Delhi
City                 Delhi
Name: 1, dtype: object

In [51]:
df.loc[3,'State'] ## it uses labels

'Maharashtra'

In [53]:
df.iloc[3,3] ## it uses index

'Maharashtra'

In [59]:
df.at[1,'City']  ## from column 'City' choose element at 1st index

'Delhi'

In [61]:
df.iat[1,4]

'Delhi'

In [63]:
### Data manipulation

data=[
    {'name':'john', 'age':17, 'class':'a'},
    {'name':'bunny', 'age':14, 'class':'c'},
    {'name':'john', 'age':12, 'class':'b'}
]

df = pd.DataFrame(data)
print(df)

    name  age class
0   john   17     a
1  bunny   14     c
2   john   12     b

In [67]:
df['Salary'] =[100,2000,3000] ## add new column
df

    name  age class  Salary
0   john   17     a     100
1  bunny   14     c    2000
2   john   12     b    3000

In [69]:
df.drop('Salary',axis=1) ##remove column

    name  age class
0   john   17     a
1  bunny   14     c
2   john   12     b

In [73]:
df

    name  age class  Salary
0   john   17     a     100
1  bunny   14     c    2000
2   john   12     b    3000

In [75]:
df.drop('Salary',axis=1, inplace=True) 
df

    name  age class
0   john   17     a
1  bunny   14     c
2   john   12     b

In [77]:
df=df.drop(0)
df

    name  age class
1  bunny   14     c
2   john   12     b